# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

In [1]:
# import
import pandas as pd

In [2]:
# Load file

url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"

in_df = pd.read_csv(url)

# Get Numeric and Categorical Data
numeric_columns = in_df.select_dtypes(include='number')
object_columns = in_df.select_dtypes(include='object')

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [4]:
# Your code here
in_df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [5]:
in_df.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [6]:
# Column names To lower case and Replace White spaces
in_df = in_df.rename(columns={col: col.lower().strip().replace(" ", "_") for col in in_df.columns})

In [7]:
# rename st to state
in_df = in_df.rename(columns= {'st': 'state'})

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [8]:
# describe the unique values of each categorical column
for col in object_columns.columns:
    un_col_val = object_columns[col].unique()
    un_col_no = object_columns[col].nunique()
    print(f"\n The no of unique values for column '{col}' is {un_col_no}")
    print(f"The unique values for column '{col}' are {un_col_val}.")

 The no of unique values for column 'Customer' is 1071
The unique values for column 'Customer' are ['RB50392' 'QZ44356' 'AI49188' ... 'CW49887' 'MY31220' nan].

 The no of unique values for column 'ST' is 8
The unique values for column 'ST' are ['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' 'Cali' 'AZ' 'WA'
 nan].

 The no of unique values for column 'GENDER' is 5
The unique values for column 'GENDER' are [nan 'F' 'M' 'Femal' 'Male' 'female'].

 The no of unique values for column 'Education' is 6
The unique values for column 'Education' are ['Master' 'Bachelor' 'High School or Below' 'College' 'Bachelors' 'Doctor'
 nan].

 The no of unique values for column 'Customer Lifetime Value' is 1027
The unique values for column 'Customer Lifetime Value' are [nan '697953.59%' '1288743.17%' ... '2031499.76%' '323912.47%'
 '899704.02%'].

 The no of unique values for column 'Number of Open Complaints' is 6
The unique values for column 'Number of Open Complaints' are ['1/0/00' '1/2/00' '1/1/00' '1/3/00' '1/5/00' '1/4/00' nan].

 The no of unique values for column 'Policy Type' is 3
The unique values for column 'Policy Type' are ['Personal Auto' 'Corporate Auto' 'Special Auto' nan].

 The no of unique values for column 'Vehicle Class' is 6
The unique values for column 'Vehicle Class' are ['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury SUV' 'Sports Car'
 'Luxury Car' nan].

In [9]:
in_df.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [10]:
# Standardize Gender Columns

def standardize_gender (label: str):
    """
    Standardize Gender Columns: if string start with F/M convert to"F"/"M" 
    """
    if isinstance(label, str):
        if label[0].upper() == "F":
            return "F"
        elif label[0].upper() == "M":
            return "M"
        else:
            return label

in_df['gender'] = in_df['gender'].apply(standardize_gender)
in_df['gender'].unique()

array([None, 'F', 'M'], dtype=object)

In [11]:
# In education, "Bachelors" could be replaced by "Bachelor"
in_df['education'] = in_df['education'].apply(lambda x: x[:-1] if x == "Bachelors" else x)
in_df['education'].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

In [12]:
#In Customer Lifetime Value, delete the % character
in_df['customer_lifetime_value'] = round(in_df['customer_lifetime_value'].str.replace('%', '').astype(float) / 100, 2)
in_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,None,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,6979.54,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,12887.43,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,7645.86,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,5363.08,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [13]:
# In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"
## different approach: sports cars have usually 2 doors --> Two-Door-Car; Luxury indicates (both Luxury Car/SUV) --> SUV

in_df["vehicle_class"].value_counts()

vehicle_class
Four-Door Car    576
Two-Door Car     205
SUV              199
Sports Car        57
Luxury SUV        20
Luxury Car        14
Name: count, dtype: int64

In [14]:
def standardize_lux_cars (label: str):
    """
    Standardize Gender Columns: if string contains luxary convert to "SUV"
    """
    if isinstance(label, str):
        if "Lux" in label:
            return "SUV"
        elif "Sport" in label:
            return "Two-Door Car"
        else:
            return label

in_df['vehicle_class'] = in_df['vehicle_class'].apply(standardize_lux_cars)
in_df['vehicle_class'].unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', None], dtype=object)

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [15]:
# Your code here

In [16]:
in_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,None,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,6979.54,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,12887.43,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,7645.86,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,5363.08,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [17]:
in_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      1071 non-null   object
 2   gender                     954 non-null    object
 3   education                  1071 non-null   object
 4   customer_lifetime_value    1068 non-null   float64
 5   income                     1071 non-null   float64
 6   monthly_premium_auto       1071 non-null   float64
 7   number_of_open_complaints  1071 non-null   object
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   float64
dtypes: float64(4), object(7)
memory usage: 344.6+ KB

In [18]:
# Customer lifetime value should be numeric
## Done already --> see above

In [19]:
# Number of open complaints has an incorrect format. Look at the different values it takes with unique() and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use split() to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.
in_df["number_of_open_complaints"].unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [20]:
in_df["number_of_open_complaints"] = in_df["number_of_open_complaints"].apply(lambda x: int(x.split("/")[1]) if isinstance(x,str) else x)
in_df["number_of_open_complaints"].unique()
# Annotation the integer casting resulted in float values

array([ 0.,  2.,  1.,  3.,  5.,  4., nan])

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [21]:
in_df.isna().any()

customer                     True
state                        True
gender                       True
education                    True
customer_lifetime_value      True
income                       True
monthly_premium_auto         True
number_of_open_complaints    True
policy_type                  True
vehicle_class                True
total_claim_amount           True
dtype: bool

In [22]:
in_df.isna().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [23]:
in_df.shape

(4008, 11)

In [24]:
in_df.notna().sum()

customer                     1071
state                        1071
gender                        954
education                    1071
customer_lifetime_value      1068
income                       1071
monthly_premium_auto         1071
number_of_open_complaints    1071
policy_type                  1071
vehicle_class                1071
total_claim_amount           1071
dtype: int64

In [25]:
in_df[in_df.isna()].notna().any()

customer                     False
state                        False
gender                       False
education                    False
customer_lifetime_value      False
income                       False
monthly_premium_auto         False
number_of_open_complaints    False
policy_type                  False
vehicle_class                False
total_claim_amount           False
dtype: bool

In [26]:
in_df[in_df.isna()]

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,NaN,NaN,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,None,NaN,NaN,NaN,NaN,NaN,NaN,None,NaN
4004,NaN,NaN,None,NaN,NaN,NaN,NaN,NaN,NaN,None,NaN
4005,NaN,NaN,None,NaN,NaN,NaN,NaN,NaN,NaN,None,NaN
4006,NaN,NaN,None,NaN,NaN,NaN,NaN,NaN,NaN,None,NaN
4007,NaN,NaN,None,NaN,NaN,NaN,NaN,NaN,NaN,None,NaN

<b style="color:green"> Strategy </b><br>
As there are many rows with 100% NaN values it looks like that these are just additional empty rows. And not rows where the data is just not available any more for any reason. I will thus drop all rows that contain only NaN values

In [27]:
in_df = in_df.dropna(how='all')

In [28]:
in_df.notna().sum()

customer                     1071
state                        1071
gender                        954
education                    1071
customer_lifetime_value      1068
income                       1071
monthly_premium_auto         1071
number_of_open_complaints    1071
policy_type                  1071
vehicle_class                1071
total_claim_amount           1071
dtype: int64

In [29]:
in_df.describe()

,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount
count,1068.000000,1071.000000,1071.000000,1071.000000,1071.000000
mean,7936.902528,39295.701214,193.234360,0.394024,404.986909
std,6434.784168,30469.427060,1601.190369,0.883769,293.027260
min,2004.350000,0.000000,61.000000,0.000000,0.382107
25%,4034.077500,14072.000000,68.000000,0.000000,202.157702
50%,5881.745000,36234.000000,83.000000,0.000000,354.729129
75%,8962.872500,64631.000000,109.500000,0.000000,532.800000
max,58166.550000,99960.000000,35354.000000,5.000000,2893.239678

<b style="color:green"> Strategy 2 </b><br>
After dropping the rows with only Nan values there are still to columns with missing values.

- "gender": here I will replace the Nan with the most frequent value (mode) in the gender column as gender is a categorical value
- "customer_lifetime_value": as we have numerical data in this case with a high variability (range) and outliers (median vs mean) I will replace the Nan values with the Median of the column

In [121]:
# Fillna gender column
in_df['gender'] = in_df['gender'].fillna(in_df['gender'].mode(dropna=True)[0])

In [35]:

in_df['customer_lifetime_value'] = in_df['customer_lifetime_value'].fillna(in_df['customer_lifetime_value'].median())

In [41]:
in_df.shape

(1071, 11)

In [42]:
in_df.isna().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [43]:
# Integer cast
in_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1071 entries, 0 to 1070
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      1071 non-null   object
 2   gender                     1071 non-null   object
 3   education                  1071 non-null   object
 4   customer_lifetime_value    1071 non-null   float64
 5   income                     1071 non-null   float64
 6   monthly_premium_auto       1071 non-null   float64
 7   number_of_open_complaints  1071 non-null   float64
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   float64
dtypes: float64(5), object(6)
memory usage: 100.4+ KB

In [54]:
# get numeric columns
numeric_columns = in_df.select_dtypes(include='number')
numeric_columns.columns

Index(['customer_lifetime_value', 'income', 'monthly_premium_auto',
       'number_of_open_complaints', 'total_claim_amount'],
      dtype='object')

In [56]:
in_df[numeric_columns.columns] = in_df[numeric_columns.columns].astype(int)

In [57]:
in_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1071 entries, 0 to 1070
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      1071 non-null   object
 2   gender                     1071 non-null   object
 3   education                  1071 non-null   object
 4   customer_lifetime_value    1071 non-null   int32
 5   income                     1071 non-null   int32
 6   monthly_premium_auto       1071 non-null   int32
 7   number_of_open_complaints  1071 non-null   int32
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   int32
dtypes: int32(5), object(6)
memory usage: 79.5+ KB

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [58]:
in_df.shape

(1071, 11)

In [95]:
in_df.duplicated().sum()

0

In [96]:
in_df.duplicated().any()

False

In [74]:
def find_duplicates(df: pd.DataFrame):
    for colname in df.columns:
        print(f"The column {colname} has {df.duplicated(subset=[colname]).sum()} duplciates.")


find_duplicates(in_df)

The column customer has 0 duplciates.
The column state has 1063 duplciates.
The column gender has 1069 duplciates.
The column education has 1066 duplciates.
The column customer_lifetime_value has 99 duplciates.
The column income has 297 duplciates.
The column monthly_premium_auto has 939 duplciates.
The column number_of_open_complaints has 1065 duplciates.
The column policy_type has 1068 duplciates.
The column vehicle_class has 1068 duplciates.
The column total_claim_amount has 576 duplciates.

In [120]:
# describe the unique values of each categorical column
for col in in_df.columns:
    un_col_val = in_df[col].unique()
    un_col_no = in_df[col].nunique()
    print(f"\n The no of unique values for column '{col}' is {un_col_no}")

 The no of unique values for column 'customer' is 1071

 The no of unique values for column 'state' is 8

 The no of unique values for column 'gender' is 2

 The no of unique values for column 'education' is 5

 The no of unique values for column 'customer_lifetime_value' is 972

 The no of unique values for column 'income' is 774

 The no of unique values for column 'monthly_premium_auto' is 132

 The no of unique values for column 'number_of_open_complaints' is 6

 The no of unique values for column 'policy_type' is 3

 The no of unique values for column 'vehicle_class' is 3

 The no of unique values for column 'total_claim_amount' is 495

<b style="color:red"> Finding </b><br>
- It looks like that the "customer" column does not have any duplicates but all the others have. Therefore excluding the "customer" column might allow us to identfy other columns with duplicates

- Other columns like state, gender, education, 'policy_type' and 'vehicle_class' etc. have view unique values increasing the likelihood that two or more customers share the same value -> "Categorical"

- Other columns like 'Customer Lifetime Value' and income are numerical and have many unique values

In [84]:
list(in_df.columns)[1:]

['state',
 'gender',
 'education',
 'customer_lifetime_value',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'policy_type',
 'vehicle_class',
 'total_claim_amount']

In [94]:
in_df[list(in_df.columns)[1:]].duplicated().any()

True

In [86]:
in_df[list(in_df.columns)[1:]].duplicated().sum()

2

In [104]:
# Getting the two duplicates
in_df.loc[in_df[list(in_df.columns)[1:]].duplicated(), :]

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
652,JH91579,Oregon,F,Bachelor,6846,0,95,0,Personal Auto,Two-Door Car,456
996,PV55726,Oregon,F,Master,4170,29462,107,1,Personal Auto,SUV,513

In [117]:
# filtering to get the original and the duplicates
in_df[(in_df["customer_lifetime_value"]==6846) & (in_df["state"] == "Oregon") | (in_df["customer_lifetime_value"]==4170) & (in_df["state"] == "Oregon")  ].sort_values("education")

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
68,GW33762,Oregon,F,Bachelor,6846,0,95,0,Personal Auto,Two-Door Car,456
652,JH91579,Oregon,F,Bachelor,6846,0,95,0,Personal Auto,Two-Door Car,456
552,GN46207,Oregon,F,Master,4170,29462,107,1,Personal Auto,SUV,513
996,PV55726,Oregon,F,Master,4170,29462,107,1,Personal Auto,SUV,513

<b style="color:green"> Strategy </b><br>

To reduce the risk to drop falls positive duplicates I select a large set of columns (only excluding the Customer ID) to drop the duplicates

In [122]:
in_df.shape

(1071, 11)

In [125]:
## check dropping the duplicates
in_df.drop_duplicates(subset=list(in_df.columns)[1:]).shape

(1069, 11)

In [126]:
## check drop the duplicates
in_df.drop_duplicates(subset=list(in_df.columns)[1:], inplace=True)

In [127]:
find_duplicates(in_df)

The column customer has 0 duplciates.
The column state has 1061 duplciates.
The column gender has 1067 duplciates.
The column education has 1064 duplciates.
The column customer_lifetime_value has 97 duplciates.
The column income has 295 duplciates.
The column monthly_premium_auto has 937 duplciates.
The column number_of_open_complaints has 1063 duplciates.
The column policy_type has 1066 duplciates.
The column vehicle_class has 1066 duplciates.
The column total_claim_amount has 574 duplciates.

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [ ]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [ ]:
# Your code here